Autodesk.Revit.DB.Structure.RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint
Returns the default positive offset direction vector for a constraint to a Shape Driven Rebar.
Remarks:
This is available only for constraints to a Shape Driven Rebar target.
Valid  Autodesk.Revit.DB.Structure.TargetRebarConstraintType are:
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsStartConnectorPressent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.EndOfBar, only if the RebarShape has a definition of RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsEndConnectorPressent
Returns:
Returns the default positive offset direction vector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not valid.
Since:
2024